[
  {
    "id": 1,
    "title": "A Remarkable Achievement in Arduino and Electronics: My Journey to Second Place",
    "thumbnail": "/events/1.jpg",
    "date": "15-16 May 2023",
    "location": "FEEIT - Skopje, Macedonia",
    "description": "Won 2nd place by making a line follower robot!",
    "content": "<h1>A Remarkable Achievement in Arduino and Electronics: My Journey to Second Place</h1><h2>Introduction</h2><p>In the realm of Arduino and electronics, I recently had the honor of participating in a prestigious competition that pushed my skills to new heights. The event, &#39;Технологија за тебе&#39; (Technology for You), took place at the esteemed Faculty of Electrical Engineering and Information Technology (FEEIT). Competing against talented students from nine other schools in Macedonia, I embarked on an exhilarating journey to create a black line follower car using Arduino, sensors, and motors. With the meticulous guidance of my mentor, I not only secured second place but was also awarded a diploma, marking a significant milestone in my career. </p><h2>The &#39;Технологија за тебе&#39; Event at FEEIT</h2><p>The two-day event at FEEIT was a celebration of technology, innovation, and collaboration. As one of the participants, I had the opportunity to showcase my skills, learn from industry experts, and network with like-minded individuals. The event kicked off with the exciting challenge of creating a black line follower car using Arduino, sensors, and motors. This task required a combination of technical knowledge, creativity, and problem-solving skills. Throughout the first day, my fellow competitors and I worked diligently on our projects, testing and fine-tuning our designs to perfection. </p><h2>Mastering the Black Line Follower Car</h2><p>Creating the black line follower car was both challenging and rewarding. Armed with Arduino, a microcontroller platform, I integrated sensors and motors into the car&#39;s design. The objective was to build a vehicle that could autonomously follow a black line while avoiding obstacles. This required precise programming and wiring, ensuring seamless communication between the sensors, motors, and the Arduino board. By leveraging my understanding of electronics and Arduino programming, I crafted a robust and efficient car that excelled in both line following and obstacle avoidance.</p><h2>Enriching Knowledge through Seminars</h2r><p>Beyond the competition, the event offered a rich learning experience. On the second day, I had the privilege of attending a seminar that explored the intricacies of microcontrollers and microcomputers. Expert speakers delved into the world of Arduino, Raspberry Pi, and MikroElektronika, unraveling their potential and real-life applications. The seminar broadened my horizons, providing valuable insights into the vast possibilities that these platforms offer. It was an exceptional opportunity to deepen my understanding of electronics and ignite my passion for further exploration.</p><h2>Collaboration and Networking</h2seminars><p>The &#39;Технологија за тебе&#39; event was not only a platform for individual achievement but also a catalyst for collaboration and networking. Throughout the two days, I had the privilege of interacting with fellow students who shared my enthusiasm for Arduino and electronics. Engaging in conversations, exchanging ideas, and learning from their experiences were invaluable aspects of the event. It was inspiring to witness the collective brilliance of the participants and foster connections with individuals who shared a common vision.</p><h2>Outstanding Organization and Gratitude</h2><p>The impeccable organization of the event at FEEIT deserves commendation. From the carefully curated agenda to the seamless flow of activities, every aspect was meticulously planned to create a conducive environment for learning and growth. I am immensely grateful to my mentor for selecting me to represent my school and guiding me throughout the competition. Their expertise and encouragement were instrumental in my success and personal development.</p><h2>Conclusion</h2g-organization-and-gratitude><p>Participating in the &#39;Технологија за тебе&#39; event at FEEIT was an exhilarating journey filled with technical challenges, enriching seminars, and meaningful connections. Securing the second-place position and being awarded a diploma in Arduino and electronics was a testament to my dedication and problem-solving skills. Securing the second place in the Arduino and Electronics competition at FEEIT was a moment of immense pride and accomplishment. It was a testament to my dedication, perseverance, and the skills I developed in the field. This achievement further fuels my passion for electronics and motivates me to continue pushing the boundaries of innovation.</p>",
    "badges": [
      { "text": "2nd Place", "color": "#6D6D6D" },
      { "text": "Arduino", "color": "#5467F1" },
      { "text": "Robots", "color": "#C70202" }
    ]
  },
  {
    "id": 2,
    "title": "Winning the Silver Medal in Computer Programming: A Journey to Inspire Gamers to Learn",
    "thumbnail": "/events/2.jpg",
    "date": "13 May 2023",
    "location": "Veles, Macedonia",
    "description": "My Quiz Web Application made in React reached the second place!",
    "content": "<h1>Winning the Silver Medal in Computer Programming: A Journey to Inspire Gamers to Learn</h1><h2>Introduction</h2><p>In the bustling world of computer programming, I recently had the privilege of participating in an individual competition that pushed my skills to new heights. The event took place in the city of Veles in Macedonia, where programmers from all over the country gathered to showcase their talents. With my project, a captivating quiz web app, I aimed to revolutionize the way people learn and provide them with an engaging alternative to mindlessly playing video games. Combining the power of React, with a plethora of features, my project sought to create a dynamic learning experience. I am thrilled to share my exhilarating journey and the recognition I received, achieving a silver medal in this prestigious competition. </p><h2>Creating the Quiz Web App</h2><p>My ambition to motivate gamers to invest their time in educational pursuits led me to conceive a remarkable quiz web application. Leveraging the capabilities of React, I was able to craft an intuitive and fully responsive app with a modern design. The app featured an extensive repository of over 4,000 questions spread across 24 categories, offering a diverse range of knowledge to cater to every user&#39;s interests. The dynamic experience was further enhanced by an experience points (XP) system, a ranking system, daily challenges, and personalized statistics for each user. </p><h2>Engaging Users and Fostering Learning</h2><p>Understanding the inherent appeal of video games, I designed the app to provide an immersive experience that would captivate users and encourage them to explore the vast sea of knowledge it offered. The XP system allowed users to earn points for each quiz completed, enabling them to level up and unlock new challenges. The ranking system fostered healthy competition among users, motivating them to strive for the top positions. Daily challenges offered a fresh dose of excitement, while personal statistics provided valuable insights into individual progress. By combining these elements, I aimed to create an environment that would entice users to spend more time learning on the app, ultimately inspiring them to shift their focus from video games to acquiring valuable information. </p><h2>The Competition in Veles, Macedonia</h2ing><p>Veles, the picturesque city where the competition unfolded, was abuzz with excitement as talented programmers gathered to exhibit their skills. The atmosphere was electric, with participants showcasing an impressive array of projects. Amidst the intense competition, I had the privilege of presenting my quiz web app to a distinguished panel of judges. The silver medal I received was a testament to the countless hours of dedication and the innovative approach I had taken to create a meaningful and impactful learning tool. </p><h2>Inspiring Gamers to Embrace Education</h2><p>Winning the silver medal not only validated my hard work but also reinforced my belief in the power of gamification as a tool for learning. By creating an engaging quiz web app that rivals the allure of video games, I hope to inspire gamers worldwide to embrace education and acquire valuable knowledge. The app&#39;s carefully curated content, coupled with its interactive features, enables users to embark on an exciting learning journey while having fun. </p><h2>Conclusion</h2gamers-to-embrace-education><p>Participating in the individual programming competition in Veles was an exhilarating experience, allowing me to showcase my quiz web app to an esteemed audience. Winning the silver medal was a testament to the efficacy of gamification in education. My mission to encourage gamers to transition from playing video games to learning valuable information has taken a significant step forward with this recognition. As I look towards the future, I am committed to refining and expanding the quiz web app, aiming to make a lasting impact on the lives of individuals seeking a meaningful learning experience.</p>",
    "badges": [
      { "text": "Silver Medal", "color": "#6D6D6D" },
      { "text": "React", "color": "#199FFF" },
      { "text": "Quiz", "color": "#A80508" }
    ]
  },
  {
    "id": 3,
    "title": "Embracing the Challenge: A Journey to 3rd Place in the National Computer Technology and Automation Competition",
    "thumbnail": "/events/3.jpg",
    "date": "04-05 May 2023",
    "location": "Ohrid, Macedonia",
    "description": "Winning a place in the top 3 against the best high-school students!",
    "content": "<h1>Embracing the Challenge: A Journey to 3rd Place in the National Computer Technology and Automation Competition</h1><h2>Introduction</h2><p>In the thrilling realm of computer technology and automation, I recently had the honor of participating in a national competition that put my skills and knowledge to the ultimate test. After securing 1st place in the municipal competition and then 2nd place in the regional competition, I found myself standing among the best 3rd-grade high school students in the country. The competition, held in the beautiful city of Ohrid, spanned two intense days of theory and practical challenges. Amidst a competitive field of talented individuals, I faced uncertainty but remained determined to give my best. In the end, securing 3rd place filled me with immense pride and gratitude for the support of my mentor and the teachers who guided me throughout this remarkable journey.</p><h2>The Journey to the National Competition</h2><p>My path to the national competition began with the municipal round, where I emerged victorious, showcasing my aptitude for computer technology and automation. This achievement paved the way for the regional competition, where I continued to hone my skills and face off against formidable opponents. Despite the challenges, my dedication and perseverance paid off as I secured 2nd place, qualifying me to represent my region in the highly anticipated national event.</p><h2>The National Competition in Ohrid</h2tition><p>Arriving in Ohrid for the national competition, I was immediately struck by the electric atmosphere. Participants from various high schools gathered to showcase their talents. The competition itself spanned two intense days, with the first day dedicated to theoretical challenges. As I immersed myself in the intricacies of computer technology and automation, I realized the level of skill possessed by my fellow competitors was truly exceptional. The practical challenges that awaited us on the second day amplified the intensity of the competition. I faced uncertainty and a surge of adrenaline as I applied my knowledge to real-world scenarios. The opportunity to engage with cutting-edge technologies and navigate complex problem-solving tasks challenged me to think critically and make swift, accurate decisions.</p><h2>A Gathering of Brilliant Minds</h2rid><p>The national competition was more than just a platform for individual achievements. It was an exceptional opportunity to connect with like-minded individuals who shared my passion for computer technology and automation. In the midst of the event, I had the pleasure of meeting fellow participants from my own city and forging new friendships with aspiring tech enthusiasts from different corners of the country. The camaraderie and shared enthusiasm fueled my determination to excel and broaden my horizons.</p><h2>Proudly Securing 3rd Place</h2inds><p>As the second day drew to a close, the tension in the air was palpable. The evening arrived, and the moment of truth was finally upon us. The results were announced, and to my immense joy, I discovered that I had secured 3rd place in the national competition. It was a moment of triumph and validation for the countless hours I had dedicated to honing my skills and expanding my knowledge. The experience was a testament to my determination and unwavering commitment to the field of computer technology and automation.</p><h2>Acknowledging Gratitude</h2ace><p>I owe a debt of gratitude to my mentor, whose guidance and unwavering support were invaluable throughout this journey. Their expertise and encouragement helped me navigate through the challenges and seize the opportunity to participate in the national competition. I am also grateful to the teachers who played a pivotal role in my growth and understanding of computer technology and automation. Their dedication to nurturing my passion and providing me with a solid foundation propelled me forward.</p><h2>Conclusion</h2ing-gratitude><p>My participation in the National Computer Technology and Automation Competition was a remarkable journey filled with challenges, learning, and growth. Winning 3rd place among the best 3rd-grade high school students in the country was a moment of pride and accomplishment.</p>",
    "badges": [
      { "text": "3rd Place", "color": "#992106" },
      { "text": "Automation", "color": "#5467F1" }
    ]
  },
  {
    "id": 4,
    "title": "Broadening Horizons: Empowering Myself with Free Software, Linux, and Data Science Seminars",
    "thumbnail": "/events/4.jpg",
    "date": "13-15 & 20-22 March 2023",
    "location": "FEEIT - Skopje, Macedonia",
    "description": "University Professors share the knowledge on these advancing IT fields.",
    "content": "<h1>Broadening Horizons: Empowering Myself with Free Software, Linux, and Data Science Seminars</h1><h2>Introduction:</h2><p>In the fast-paced world of technology, staying updated with the latest advancements is crucial. Recently, I had the privilege of attending two enlightening seminars at the esteemed Faculty of Electrical Engineering and Information Technologies (FEEIT). The first seminar focused on Free Software and Linux, while the second delved into the fascinating realms of Data Science and Machine Learning. Over the course of three days each, these seminars provided invaluable insights and equipped me with essential knowledge that will shape my journey in the IT industry. In this article, I will share my experience and the transformative impact these seminars had on my understanding of these subjects.</p><h2>Exploring Free Software and Linux:</h2><p>The first seminar, dedicated to Free Software and Linux, was a gateway to a world of limitless possibilities. Over the course of three hours each day, I delved into the purpose and significance of free software, understanding its role in promoting accessibility, collaboration, and innovation. Moreover, I learned how Linux seamlessly integrates with the Python programming language, a powerful combination that piqued my interest, especially considering my ownership of a Raspberry Pi. This newfound knowledge opened doors to utilizing the Raspberry Pi for problem-solving and leveraging its potential in future projects.</p><h2>The Data Science and Machine Learning Journey:</h2><p>The following week, I immersed myself in the realm of Data Science and Machine Learning during another three-day seminar. As a novice in the field, I was initially overwhelmed by the breadth and depth of the subject matter. However, the seminar provided real-world examples that demystified the concepts and sparked my curiosity. I witnessed how data analytics and machine learning algorithms can unravel insights from complex datasets, paving the way for informed decision-making. Python's pivotal role in visualizing data and its applications in Artificial Intelligence further broadened my understanding of this rapidly evolving field.</p><h2>The Value of Acquiring Knowledge:</h2><p>Participating in these seminars was an empowering experience that emphasized the importance of continuous learning in the IT industry. As technology advances at a rapid pace, expanding one's understanding becomes paramount. The knowledge gained from the seminars will enable me to adapt to new challenges, embrace emerging trends, and contribute meaningfully to the evolving landscape of science and technology.</p><h2>Conclusion:</h2><p>As the IT industry continues to advance at an unprecedented pace, it is essential for individuals to continually acquire and update their knowledge. The seminars at FEEIT have provided me with a solid foundation to navigate these evolving landscapes confidently. Armed with this newfound knowledge, I am excited to embark on future endeavors, utilizing the concepts and techniques I have learned to make a meaningful impact in the field of technology.</p>",
    "badges": [
      { "text": "Linux", "color": "#C94A00" },
      { "text": "Data Science", "color": "#199FFF" },
      { "text": "AI", "color": "#41A744" }
    ]
  },
  {
    "id": 5,
    "title": "A Triumph of Perspicacity: Embracing the 3th Place in Arduino and Electronics Competition",
    "thumbnail": "/events/5.jpg",
    "date": "09-10 May 2022",
    "location": "FEEIT - Skopje, Macedonia",
    "description": "Landed in the Top 3 on the first appearence here!",
    "content": "<h1>A Triumph of Perspicacity: Embracing the 3rd Place in the Arduino and Electronics Competition</h1><h2>Introduction:</h2><p>In the captivating world of Arduino and electronics, I recently had the privilege of participating in a highly anticipated competition that put my skills to the test. The event, &#39;Технологија за тебе&#39; (Technology for You), took place at the esteemed Faculty of Electrical Engineering and Information Technology (FEEIT). Competing against students from seven other schools in Macedonia, I embarked on an exhilarating journey to create a photoplethysmograph—a device that measures one's pulse. With determination and a touch of perspicacity, I navigated through the challenges and proudly secured 3rd place. This achievement marked a significant milestone in my journey into the world of electronics, and I am thrilled to share the details of this remarkable experience.</p><h2>The &#39;Технологија за тебе&#39; Event at FEEIT:</h2><p>The two-day event at FEEIT was a celebration of technological innovation and learning. As a first-time participant, I was eager to engage with the brilliant minds gathered at this prestigious venue. The first day of the event was dedicated to the competition, where students from various schools showcased their prowess in Arduino and electronics. The atmosphere was charged with excitement as we worked diligently to complete the challenging task of creating a functional photoplethysmograph.</p><h2>Overcoming Challenges:</h2><p>While I may not consider myself an expert in electronics, my perspicacity and determination propelled me to find innovative solutions. Building a photoplethysmograph proved to be a demanding challenge, requiring a deep understanding of electronic components and their interactions. Through meticulous research and a keen eye for detail, I was able to overcome the obstacles and construct a device that effectively measured pulse rates. It was a test of my problem-solving skills, and I am proud to have sealed a decent result despite the initial hurdles.</p><h2>The Seminar on Microcomputers and Microcontrollers:</h2><p>On the second day of the event, participants were treated to a stimulating seminar on microcomputers and microcontrollers. Expert speakers shared valuable insights into the latest technologies and their applications. The seminar expanded my knowledge and provided me with a glimpse into the cutting-edge advancements in the field. It was an enlightening experience that further ignited my passion for electronics and Arduino.</p><h2>Revelation of Results and Triumph:</h2><p>As the event neared its conclusion, anticipation filled the air. The time had come to reveal the competition results. A mixture of excitement and nervousness coursed through me as the winners were announced. To my delight, I learned that my efforts and perspicacity had secured me the 3rd place in the competition. The sense of achievement washed over me, validating the hard work and dedication I had poured into my project. As a reward, I was honored to receive a coveted Raspberry Pi 4 Model B, a prized possession that holds immense value in the world of electronics.</p><h2>Expressing Gratitude:</h2><p>In this exhilarating journey, I owe immense gratitude to my mentor, whose unwavering belief in my abilities and guidance allowed me to represent my school for the first time at such a prestigious event. Their support and encouragement were instrumental in my success, and I am deeply grateful for the opportunity they provided me. I also extend my appreciation to the organizers of the event at FEEIT for curating an exceptional platform for students to showcase their talents and expand their horizons.</p><h2>Conclusion:</h2><p>Participating in the Arduino and electronics competition at FEEIT's &#39;Технологија за тебе&#39; event was a thrilling adventure that tested my skills and pushed me to explore new frontiers. With perspicacity and determination, I tackled the challenges and unleashed my potential in the realm of electronics. Securing 3rd place was a proud moment for me, as it validated my ability to navigate unfamiliar territory and compete among the best in the field.</p>",
    "badges": [
      { "text": "3rd Place", "color": "#992106" },
      { "text": "Arduino", "color": "#5467F1" }
    ]
  }
]